import catcard_1 from '../images/catcard/catcard-1.jpg';
import about_1 from '../images/about/about-1.jpeg';

export const aboutText =
  'Ассортимент импортного оборудования,' +
  'поставляемого компанией ДАЛКОС, позволяет удовлетворить потребности клиентов в высокотехнологичном оборудовании для испытаний и измерений, оборудовании для обработки и переработки материалов, оборудовании для конвейерных и транспортных систем, оборудовании для подготовки и подачи воздуха и воды, в отдельных узлах и частях технологических линий, а также в гидравлическом оборудовании, генераторах, компрессорах, насосном, пневматическом оборудовании, электродвигателях и приводной техники, компонентах автоматики и электроники, ЗИП и расходных материалах.' +
  '\n\n' +
  'Кроме того, богатый опыт работы на рынке промышленных компонентов позволяет нам быстро идентифицировать необходимую Вам запасную часть,\n а также оперативно предложить аналог в случае, если требуемая запасная часть оборудования больше не выпускается. А четко отлаженная система логистики позволяет обеспечить доставку необходимого клиенту оборудования и запасных частей в кратчайшие сроки.';

export const socialsObj = [
  {
    name: 'Вконтакте',
    link: 'https://vk.com/kinobmstu',
    icon: (
      <svg
        width="800px"
        height="800px"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg">
        <path
          fill-rule="evenodd"
          clip-rule="evenodd"
          d="M22 12C22 17.5228 17.5228 22 12 22C6.47715 22 2 17.5228 2 12C2 6.47715 6.47715 2 12 2C17.5228 2 22 6.47715 22 12ZM12.3583 9.38244C11.3857 9.787 9.44177 10.6243 6.52657 11.8944C6.05318 12.0827 5.8052 12.2669 5.78263 12.4469C5.74448 12.7513 6.12559 12.8711 6.64455 13.0343C6.71515 13.0565 6.78829 13.0795 6.86327 13.1038C7.37385 13.2698 8.06068 13.464 8.41773 13.4717C8.74161 13.4787 9.1031 13.3452 9.50219 13.0711C12.226 11.2325 13.632 10.3032 13.7202 10.2831C13.7825 10.269 13.8688 10.2512 13.9273 10.3032C13.9858 10.3552 13.98 10.4536 13.9738 10.48C13.9361 10.641 12.4401 12.0318 11.6659 12.7515C11.4246 12.9759 11.2534 13.135 11.2184 13.1714C11.14 13.2528 11.0601 13.3298 10.9833 13.4038C10.509 13.8611 10.1532 14.204 11.003 14.764C11.4114 15.0331 11.7381 15.2556 12.0641 15.4776C12.4201 15.7201 12.7752 15.9619 13.2347 16.2631C13.3517 16.3398 13.4635 16.4195 13.5724 16.4971C13.9867 16.7925 14.3589 17.0579 14.8188 17.0155C15.086 16.991 15.362 16.7397 15.5022 15.9903C15.8335 14.2193 16.4847 10.382 16.6352 8.80081C16.6484 8.66228 16.6318 8.48498 16.6185 8.40715C16.6051 8.32932 16.5773 8.21842 16.4761 8.13633C16.3563 8.03911 16.1714 8.01861 16.0886 8.02C15.7125 8.0267 15.1354 8.22735 12.3583 9.38244Z"
          fill="#000000"
        />
      </svg>
    ),
  },
];

export const aboutImage = [
  {
    name: 'Целлюлозно-бумажные комбинаты',
    image: about_1,
  },
];

export const catcards = [
  {
    name: 'Целлюлозно-бумажные комбинаты',
    link: 'https://vk.com/kinobmstu',
    image:
      'https://images.wallpaperscraft.ru/image/single/minimalizm_nebo_oblaka_95458_1920x1080.jpg',
  },
  {
    name: 'Производство продуктов питания',
    link: 'https://vk.com/kinobmstu',
    image:
      'https://images.wallpaperscraft.ru/image/single/minimalizm_geometricheskij_pejzazh_124072_800x1280.jpg',
  },
  {
    name: 'Горнообогатительные комбинаты',
    link: 'https://vk.com/kinobmstu',
    image:
      'https://images.wallpaperscraft.ru/image/single/minimalizm_art_irokez_98827_1280x1280.jpg',
  },
  {
    name: 'Деревообрабатывающее производство',
    link: 'https://vk.com/kinobmstu',
    image: catcard_1,
  },
  {
    name: 'Птицеводство и животноводство',
    link: 'https://vk.com/kinobmstu',
    image: catcard_1,
  },
  {
    name: 'Сборочные производства предприятий',
    link: 'https://vk.com/kinobmstu',
    image: catcard_1,
  },
  {
    name: 'Машиностроительные заводы',
    link: 'https://vk.com/kinobmstu',
    image: catcard_1,
  },
  {
    name: 'Нефтеперерабатывающие заводы',
    link: 'https://vk.com/kinobmstu',
    image: catcard_1,
  },
  {
    name: 'Металлургические комбинаты',
    link: 'https://vk.com/kinobmstu',
    image: catcard_1,
  },
];

export const equipmentTree = {
  'avtomatika i elektronika': {
    img: 'https://images.wallpaperscraft.ru/image/single/minimalizm_geometricheskij_pejzazh_124072_800x1280.jpg',
    translateRus: "Автоматика и электроника",
    children: {
      'Jostici promishlennie': {
        img: catcard_1,
        translateRus: "Джойстики промышленные",
        children: {
          'Jostici Bosch Rexroth': {
            img: 'https://images.wallpaperscraft.ru/image/single/minimalizm_geometricheskij_pejzazh_124072_800x1280.jpg',
            translateRus: "Джойстики Bosch Rexroth",
            children: {
              'Rexroth 4TH6E06-1X/YU23/M05 | R907229581 Pult upravlenie': {
                manufacturer: "Bosch Rexroth",
                translateRus: "Rexroth 4TH6E06-1X/YU23/M05 | R907229581 Пульт управления",
                img: catcard_1,
                description: `
                Дизельная электростанция Spitzenreiter, серии SCW смонтирована на общей раме, представляет собой единую конструкцию. Состоит из двигателя и генератора переменного тока соединенных между собой виброустойчивой муфтой. Включает в себя все узлы для нормальной работы, а также автоматическую систему управления. Применяется для нужд горнодобывающей и нефтегазовой промышленности, в автомобилестроении, а также в сельском хозяйстве и малой энергетике.
                `,
                specifications: [
                  "Напряжение: 24 В",
                  "Рабочая температура: от 0 до +45 °C"
                ],
                marking: ["asfawd", "asdwfwa"],
              },
            },
          },
          'Джойстики управления оператора EUCHNER': {},
        },
      },
    }
  },
  "generatory": {
    img: about_1,
    translateRus: "генераторы",
    children: {},
  },
  'kompressory-turbinyфцва  фыв': {
    img: catcard_1,
    translateRus: "Компрессоры, турбины",
    children: {},
  },
};
